leander98/esp32-ism330dlc/include/esp32-ism330dlc_registers.h
#define MASTER_CMD_CODE                 0x60   /*R/W - Master command code register*/

#define SENS_SYNC_SPI_ERROR_CODE        0x61   /*R - Sensor synchronization SPI error code register*/

#define OUT_MAG_RAW_X_L                 0x66   /*R - Output magnetometer X-axis low register*/
#define OUT_MAG_RAW_X_H                 0x67   /*R - Output magnetometer X-axis high register*/
#define OUT_MAG_RAW_Y_L                 0x68   /*R - Output magnetometer Y-axis low register*/
#define OUT_MAG_RAW_Y_H                 0x69   /*R - Output magnetometer Y-axis high register*/
#define OUT_MAG_RAW_Z_L                 0x6A   /*R - Output magnetometer Z-axis low register*/
#define OUT_MAG_RAW_Z_H                 0x6B   /*R - Output magnetometer Z-axis high register*/

#define INT_OIS                         0x6F   /*R/W - Interrupt OIS configuration register*/

#define CTRL1_OIS                       0x70   /*R/W - Control register 1 - OIS*/
#define CTRL2_OIS                       0x71   /*R/W - Control register 2 - OIS*/
#define CTRL3_OIS                       0x72   /*R/W - Control register 3 - OIS*/
#define X_OFS_USR                       0x73   /*R/W - X-axis offset user register*/
#define Y_OFS_USR                       0x74   /*R/W - Y-axis offset user register*/
#define Z_OFS_USR                       0x75   /*R/W - Z-axis offset user register*/


/** Register bit mapping */

/*FUNC_CFG_ACCESS*/
typedef union {
    struct {
        uint8_t uFunc_Cfg_Gen : 1;              /*Enable access to the embedded functions configuration registers, 0: disabled, 1: enabled*/
        uint8_t uReserved : 7;
    };
    uint8_t byte;
} ism330dlc_FUNC_CFG_ACCESS_t;

/*SENSOR_SYNC_TIME_FRAME*/
typedef union {
    struct {
        uint8_t uReserved : 4;
        uint8_t uSensor_Sync_Time_Frame : 4;    /*Sensor synchronization time frame with a step of 500 ms and full range of 5 s. Unsigned 8-bit. Default value: 0000 0000 (sensor sync disabled)*/
    };
    uint8_t byte;
} ism330dlc_SENSOR_SYNC_TIME_FRAME_t;

/*SENSOR_SYNC_RES_RATIO*/
typedef union {
    struct {
        uint8_t uReserved : 6;
        uint8_t uSensor_Sync_Res_Ratio : 2;     /*Resolution ratio of error code for sensor synchronization.*/
    };
    uint8_t byte;
} ism330dlc_SENSOR_SYNC_RES_RATIO_t;

/*FIFO_CTRL_1*/
typedef union {
    struct {
        uint8_t uFifo_Threshold : 8;            /*FIFO threshold. Unsigned 8-bit. Default value: 0000 0000*/
    };
    uint8_t byte;
} ism330dlc_FIFO_CTRL_1_t;

/*FIFO_CTRL_2*/
typedef union {
    struct {
        uint8_t uFIFO_TIMER_EN : 1;             /*FIFO timer enable. 0: disabled, 1: enabled*/
        uint8_t uReserved: 3;
        uint8_t uFIFO_TEMP_EN : 1;              /*FIFO temperature enable. 0*/
        uint8_t uFifo_Threshold : 3;            /*FIFO threshold. Unsigned 8-bit. Default value: 0000 0000*/
    };
    uint8_t byte;
} ism330dlc_FIFO_CTRL_2_t;

/*FIFO_CTRL_3*/
typedef union {
    struct {
        uint8_t uDec_FIFO_XL : 3;               /*Accelerometer FIFO data set decimation setting*/
        uint8_t uDec_FIFO_GYRO : 3;             /*Gyroscope FIFO data set decimation setting*/
        uint8_t uReserved : 2;
    };
    uint8_t byte;
} ism330dlc_FIFO_CTRL_3_t;

/*FIFO_CTRL_4*/
typedef union {
    struct {
        uint8_t uDec_DS3_FIFO : 3;              /*Third FIFO data set decimation setting*/
        uint8_t uDec_DS4_FIFO : 3;              /*Fourth FIFO data set decimation setting*/
        uint8_t uONLY_HIGH_DATA : 1;            /*8-bit data storage in FIFO*/
        uint8_t uSTOP_ON_FTH : 1;               /*FIFO threshold level use enable*/
    };
    uint8_t byte;
} ism330dlc_FIFO_CTRL_4_t;

/*FIFO_CTRL_5*/
typedef union {
    struct {
        uint8_t uFIFO_MODE : 3;                 /*FIFO mode selection bits*/
        uint8_t uODR_FIFO : 4;                  /*FIFO ODR selection*/
        uint8_t uReserved : 1;
    };
    uint8_t byte;
} ism330dlc_FIFO_CTRL_5_t;

/*DRDY_PULSE_CFG*/
typedef union {
    struct {
        uint8_t uDRDY_PULSED : 1;               /*Enables pulsed data-ready mode*/
        uint8_t uReserved : 7;
    };
    uint8_t byte;
} ism330dlc_DRDY_PULSE_CFG_t;

/*INT1_CTRL*/
typedef union {
    struct {
        uint8_t uReserved : 2;
        uint8_t uINT1_FULL_FLAG : 1;            /*FIFO full flag interrupt on INT1*/
        uint8_t uINT1_FIFO_OVR : 1;             /*FIFO overrun interrupt on INT1*/
        uint8_t uINT1_FTH : 1;                  /*FIFO threshold interrupt on INT1*/
        uint8_t uINT1_BOOT : 1;                 /*Boot status on INT1*/
        uint8_t uINT1_DRDY_G : 1;               /*Gyroscope data-ready on INT1*/
        uint8_t uINT1_DRDY_XL : 1;              /*Accelerometer data-ready on INT1*/
    };
    uint8_t byte;
} ism330dlc_INT1_CTRL_t;

/*INT2_CTRL*/
typedef union {
    struct {
        uint8_t uReserved : 2;
        uint8_t uINT2_FULL_FLAG : 1;            /*FIFO full flag interrupt on INT2*/
        uint8_t uINT2_FIFO_OVR : 1;             /*FIFO overrun interrupt on INT2*/
        uint8_t uINT2_FTH : 1;                  /*FIFO threshold interrupt on INT2*/
        uint8_t uINT2_DRDY_TEMP : 1;            /*Temperature data-ready on INT2*/
        uint8_t uINT2_DRDY_G : 1;               /*Gyroscope data-ready on INT2*/
        uint8_t uINT2_DRDY_XL : 1;              /*Accelerometer data-ready on INT2*/
    };
    uint8_t byte;
} ism330dlc_INT2_CTRL_t;

/*WHO_AM_I*/
typedef union {
    struct {
        uint8_t uWhoAmI : 8;                    /*Fixed device ID, expected value 0x6A*/
    };
    uint8_t byte;
} ism330dlc_WHO_AM_I_t;

/*CTRL1_XL*/
typedef union {
    struct {
        uint8_t uODR_XL : 4;                    /*Accelerometer output data rate selection*/
        uint8_t uFS_XL : 2;                     /*Accelerometer full-scale selection*/
        uint8_t uLPF1_BW_SEL : 1;               /*Accelerometer LPF1 bandwidth selection*/
        uint8_t uBW0_XL : 1;                    /*Accelerometer analog chain bandwidth selection*/
    };
    uint8_t byte;
} ism330dlc_CTRL1_XL_t;

/*CTRL2_G*/
typedef union {
    struct {
        uint8_t uODR_G : 4;                     /*Gyroscope output data rate selection*/
        uint8_t uFS_G : 2;                      /*Gyroscope full-scale selection*/
        uint8_t uFS_125 : 1;                    /*Gyroscope full-scale at ±125 dps*/
        uint8_t uReserved : 1;
    };
    uint8_t byte;
} ism330dlc_CTRL2_G_t;

/*CTRL3_C*/
typedef union {
    struct {
        uint8_t uBOOT : 1;                      /*Reboot memory content*/
        uint8_t uBDU : 1;                       /*Block data update*/
        uint8_t uH_LACTIVE : 1;                 /*Interrupt activation level*/
        uint8_t uPP_OD : 1;                     /*Push-pull/open-drain selection*/
        uint8_t uSIM : 1;                       /*SPI serial interface mode selection*/
        uint8_t uIF_INC : 1;                    /*Register address auto increment*/
        uint8_t uBLE : 1;                       /*Big/little endian selection*/
        uint8_t uSW_RESET : 1;                  /*Software reset*/
    };
    uint8_t byte;
} ism330dlc_CTRL3_C_t;

/*CTRL4_C*/
typedef union {
    struct {
        uint8_t uDEN_XL_EN : 1;                 /*Extend DEN functionality to accelerometer*/
        uint8_t uSLEEP : 1;                     /*Gyroscope sleep mode enable*/
        uint8_t uINT2_on_INT1 : 1;              /*Enable all INT2 signals on INT1*/
        uint8_t uDEN_DRDY_INT1 : 1;             /*DEN DRDY signal on INT1*/
        uint8_t uDRDY_MASK : 1;                 /*Data available masking*/
        uint8_t uI2C_disable : 1;               /*Disable I²C interface*/
        uint8_t uLPF1_SEL_G : 1;                /*Enable gyroscope LPF1*/
        uint8_t uReserved : 1;
    };
    uint8_t byte;
} ism330dlc_CTRL4_C_t;

/*CTRL5_C*/
typedef union {
    struct {
        uint8_t uROUNDING : 3;                  /*Output register wraparound pattern*/
        uint8_t uDEN_LH : 1;                    /*DEN active level configuration*/
        uint8_t uST_G : 2;                      /*Gyroscope self-test enable*/
        uint8_t uST_XL : 2;                     /*Accelerometer self-test enable*/
    };
    uint8_t byte;
} ism330dlc_CTRL5_C_t;

/*CTRL6_C*/
typedef union {
    struct {
        uint8_t uTRIG_EN : 1;                   /*Enable DEN edge-sensitive trigger*/
        uint8_t uLVL1_EN : 1;                   /*Enable DEN level-sensitive trigger*/
        uint8_t uLVL2_EN : 1;                   /*Enable DEN level-sensitive latched*/
        uint8_t uXL_HM_MODE : 1;                /*Disable accelerometer high-performance mode*/
        uint8_t uUSR_OFF_W : 1;                 /*Weight of accelerometer user offset bits*/
        uint8_t uReserved : 1;
        uint8_t uFTYPE : 2;                     /*Gyroscope LPF1 bandwidth selection*/
    };
    uint8_t byte;
} ism330dlc_CTRL6_C_t;

/*CTRL7_G*/
typedef union {
    struct {
        uint8_t uG_HM_MODE : 1;                 /*Disable gyroscope high-performance mode*/
        uint8_t uHP_EN_G : 1;                   /*Enable gyroscope digital high-pass filter*/
        uint8_t uHPM_G : 2;                     /*Gyroscope HP filter cutoff selection*/
        uint8_t uReserved2 : 1;
        uint8_t uROUNDING_STATUS : 1;           /*Source register wraparound function*/
        uint8_t uReserved0 : 1;
        uint8_t uReserved1 : 1;
    };
    uint8_t byte;
} ism330dlc_CTRL7_G_t;

