leander98/esp32-ism330dlc/include/esp32-ism330dlc_registers.h
/*CTRL8_XL*/
typedef union {
    struct {
        uint8_t uLPF2_XL_EN : 1;                /*Accelerometer LPF2 enable*/
        uint8_t uHPCF_XL : 2;                   /*Accelerometer LPF2 / HP filter config*/
        uint8_t uHP_REF_MODE : 1;               /*Enable HP filter reference mode*/
        uint8_t uINPUT_COMPOSITE : 1;           /*Composite filter input selection*/
        uint8_t uHP_SLOPE_XL_EN : 1;            /*Slope/high-pass filter selection*/
        uint8_t uReserved : 1;
        uint8_t uLOW_PASS_ON_6D : 1;            /*LPF2 on 6D function selection*/
    };
    uint8_t byte;
} ism330dlc_CTRL8_XL_t;

/*CTRL9_XL*/
typedef union {
    struct {
        uint8_t uDEN_X : 1;                     /*Store DEN in X-axis LSB*/
        uint8_t uDEN_Y : 1;                     /*Store DEN in Y-axis LSB*/
        uint8_t uDEN_Z : 1;                     /*Store DEN in Z-axis LSB*/
        uint8_t uDEN_XL_G : 1;                  /*DEN stamping sensor selection*/
        uint8_t uReserved2 : 1;
        uint8_t uSOFT_EN : 1;                   /*Enable soft-iron correction algorithm*/
        uint8_t uReserved0 : 1;
        uint8_t uReserved1 : 1;
    };
    uint8_t byte;
} ism330dlc_CTRL9_XL_t;

/*CTRL10_C*/
typedef union {
    struct {
        uint8_t uReserved3 : 1;
        uint8_t uReserved4 : 1;
        uint8_t uTIMER_EN : 1;                  /*Enable timestamp count*/
        uint8_t uReserved2 : 1;
        uint8_t uTILT_EN : 1;                   /*Enable tilt calculation*/
        uint8_t uFUNC_EN : 1;                   /*Enable embedded functionalities*/
        uint8_t uReserved0 : 1;
        uint8_t uReserved1 : 1;
    };
    uint8_t byte;
} ism330dlc_CTRL10_C_t;

/*MASTER_CONFIG*/
typedef union {
    struct {
        uint8_t uDRDY_ON_INT1 : 1;              /*Master DRDY signal on INT1*/
        uint8_t uDATA_VALID_SEL_FIFO : 1;       /*Selection of FIFO data-valid signal*/
        uint8_t uReserved : 1;
        uint8_t uSTART_CONFIG : 1;              /*Sensor hub trigger signal selection*/
        uint8_t uPULL_UP_EN : 1;                /*Auxiliary I²C pull-up*/
        uint8_t uPASS_THROUGH_MODE : 1;         /*I²C interface pass-through*/
        uint8_t uIRON_EN : 1;                   /*Enable hard-iron correction algorithm*/
        uint8_t uMASTER_ON : 1;                 /*Enable sensor hub I²C master*/
    };
    uint8_t byte;
} ism330dlc_MASTER_CONFIG_t;

/*WAKE_UP_SRC*/
typedef union {
    struct {
        uint8_t uReserved : 2;
        uint8_t uFF_IA : 1;                     /*Free-fall event detected*/
        uint8_t uSLEEP_STATE_IA : 1;            /*Sleep event status*/
        uint8_t uWU_IA : 1;                     /*Wake-up event detected*/
        uint8_t uX_WU : 1;                      /*Wake-up event on X-axis*/
        uint8_t uY_WU : 1;                      /*Wake-up event on Y-axis*/
        uint8_t uZ_WU : 1;                      /*Wake-up event on Z-axis*/
    };
    uint8_t byte;
} ism330dlc_WAKE_UP_SRC_t;

/*TAP_SRC*/
typedef union {
    struct {
        uint8_t uReserved : 1;
        uint8_t uTAP_IA : 1;                    /*Tap event detected*/
        uint8_t uSINGLE_TAP : 1;                /*Single-tap event status*/
        uint8_t uDOUBLE_TAP : 1;                /*Double-tap event status*/
        uint8_t uTAP_SIGN : 1;                  /*Sign of acceleration detected by tap event*/
        uint8_t uX_TAP : 1;                     /*Tap event on X-axis*/
        uint8_t uY_TAP : 1;                     /*Tap event on Y-axis*/
        uint8_t uZ_TAP : 1;                     /*Tap event on Z-axis*/
    };
    uint8_t byte;
} ism330dlc_TAP_SRC_t;

/*D6D_SRC*/
typedef union {
    struct {
        uint8_t uDEN_DRDY : 1;                  /*DEN data-ready signal*/
        uint8_t uD6D_IA : 1;                    /*6D orientation interrupt active*/
        uint8_t uZH : 1;                        /*Z-axis high event*/
        uint8_t uZL : 1;                        /*Z-axis low event*/
        uint8_t uYH : 1;                        /*Y-axis high event*/
        uint8_t uYL : 1;                        /*Y-axis low event*/
        uint8_t uXH : 1;                        /*X-axis high event*/
        uint8_t uXL : 1;                        /*X-axis low event*/
    };
    uint8_t byte;
} ism330dlc_D6D_SRC_t;

/*STATUS_REG*/
typedef union {
    struct {
        uint8_t uReserved : 5;
        uint8_t uTDA : 1;                       /*Temperature new data available*/
        uint8_t uGDA : 1;                       /*Gyroscope new data available*/
        uint8_t uXLDA : 1;                      /*Accelerometer new data available*/
    };
    uint8_t byte;
} ism330dlc_STATUS_REG_t;

/*Byte-wide output/status registers*/
typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_OUT_TEMP_L_t;
typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_OUT_TEMP_H_t;
typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_OUTX_L_G_t;
typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_OUTX_H_G_t;
typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_OUTY_L_G_t;
typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_OUTY_H_G_t;
typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_OUTZ_L_G_t;
typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_OUTZ_H_G_t;
typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_OUTX_L_XL_t;
typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_OUTX_H_XL_t;
typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_OUTY_L_XL_t;
typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_OUTY_H_XL_t;
typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_OUTZ_L_XL_t;
typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_OUTZ_H_XL_t;
typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_SENSORHUB1_REG_t;
typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_SENSORHUB2_REG_t;
typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_SENSORHUB3_REG_t;
typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_SENSORHUB4_REG_t;
typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_SENSORHUB5_REG_t;
typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_SENSORHUB6_REG_t;
typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_SENSORHUB7_REG_t;
typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_SENSORHUB8_REG_t;
typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_SENSORHUB9_REG_t;
typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_SENSORHUB10_REG_t;
typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_SENSORHUB11_REG_t;
typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_SENSORHUB12_REG_t;

