leander98/esp32-ism330dlc/include/esp32-ism330dlc_registers.h
/*FIFO_STATUS1*/
typedef union {
    struct {
        uint8_t uDIFF_FIFO : 8;                 /*Unread FIFO words [7:0]*/
    };
    uint8_t byte;
} ism330dlc_FIFO_STATUS1_t;

/*FIFO_STATUS2*/
typedef union {
    struct {
        uint8_t uWaterM : 1;                    /*FIFO watermark status*/
        uint8_t uOVER_RUN : 1;                  /*FIFO overrun status*/
        uint8_t uFIFO_FULL_SMART : 1;           /*Smart FIFO full status*/
        uint8_t uFIFO_EMPTY : 1;                /*FIFO empty status*/
        uint8_t uReserved : 1;
        uint8_t uDIFF_FIFO_H : 3;               /*Unread FIFO words [10:8]*/
    };
    uint8_t byte;
} ism330dlc_FIFO_STATUS2_t;

/*FIFO_STATUS3*/
typedef union {
    struct {
        uint8_t uFIFO_PATTERN : 8;              /*FIFO pattern [7:0]*/
    };
    uint8_t byte;
} ism330dlc_FIFO_STATUS3_t;

/*FIFO_STATUS4*/
typedef union {
    struct {
        uint8_t uReserved : 6;
        uint8_t uFIFO_PATTERN_H : 2;            /*FIFO pattern [9:8]*/
    };
    uint8_t byte;
} ism330dlc_FIFO_STATUS4_t;

typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_FIFO_DATA_OUT_L_t;
typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_FIFO_DATA_OUT_H_t;
typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_TIMESTAMP0_REG_t;
typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_TIMESTAMP1_REG_t;
typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_TIMESTAMP2_REG_t;
typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_SENSORHUB13_REG_t;
typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_SENSORHUB14_REG_t;
typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_SENSORHUB15_REG_t;
typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_SENSORHUB16_REG_t;
typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_SENSORHUB17_REG_t;
typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_SENSORHUB18_REG_t;

/*FUNC_SRC1*/
typedef union {
    struct {
        uint8_t uReserved2 : 2;
        uint8_t uTILT_IA : 1;                   /*Tilt event detection status*/
        uint8_t uReserved : 2;
        uint8_t uHI_FAIL : 1;                   /*Hard/soft-iron algorithm fail*/
        uint8_t uSI_END_OP : 1;                 /*Hard/soft-iron calculation status*/
        uint8_t uSENSORHUB_END_OP : 1;          /*Sensor hub communication status*/
    };
    uint8_t byte;
} ism330dlc_FUNC_SRC1_t;

/*FUNC_SRC2*/
typedef union {
    struct {
        uint8_t uReserved2 : 1;
        uint8_t uSLAVE3_NACK : 1;               /*NACK on slave 3 communication*/
        uint8_t uSLAVE2_NACK : 1;               /*NACK on slave 2 communication*/
        uint8_t uSLAVE1_NACK : 1;               /*NACK on slave 1 communication*/
        uint8_t uSLAVE0_NACK : 1;               /*NACK on slave 0 communication*/
        uint8_t uReserved : 3;
    };
    uint8_t byte;
} ism330dlc_FUNC_SRC2_t;

/*TAP_CFG*/
typedef union {
    struct {
        uint8_t uINTERRUPTS_ENABLE : 1;         /*Enable basic interrupts*/
        uint8_t uINACT_EN : 2;                  /*Inactivity function enable*/
        uint8_t uSLOPE_FDS : 1;                 /*HPF or SLOPE filter selection*/
        uint8_t uTAP_X_EN : 1;                  /*Enable X direction in tap recognition*/
        uint8_t uTAP_Y_EN : 1;                  /*Enable Y direction in tap recognition*/
        uint8_t uTAP_Z_EN : 1;                  /*Enable Z direction in tap recognition*/
        uint8_t uLIR : 1;                       /*Latched interrupt*/
    };
    uint8_t byte;
} ism330dlc_TAP_CFG_t;

/*TAP_THS_6D*/
typedef union {
    struct {
        uint8_t uD4D_EN : 1;                    /*4D orientation detection enable*/
        uint8_t uSIXD_THS : 2;                  /*Threshold for 4D/6D function*/
        uint8_t uTAP_THS : 5;                   /*Threshold for tap recognition*/
    };
    uint8_t byte;
} ism330dlc_TAP_THS_6D_t;

/*INT_DUR2*/
typedef union {
    struct {
        uint8_t uDUR : 4;                       /*Maximum time gap for double-tap recognition*/
        uint8_t uQUIET : 2;                     /*Expected quiet time after tap detection*/
        uint8_t uSHOCK : 2;                     /*Maximum duration of overthreshold event*/
    };
    uint8_t byte;
} ism330dlc_INT_DUR2_t;

/*WAKE_UP_THS*/
typedef union {
    struct {
        uint8_t uSINGLE_DOUBLE_TAP : 1;         /*Single/double-tap event enable*/
        uint8_t uReserved : 1;
        uint8_t uWK_THS : 6;                    /*Threshold for wakeup*/
    };
    uint8_t byte;
} ism330dlc_WAKE_UP_THS_t;

/*WAKE_UP_DUR*/
typedef union {
    struct {
        uint8_t uFF_DUR5 : 1;                   /*Free-fall duration event MSb*/
        uint8_t uWAKE_DUR : 2;                  /*Wake up duration event*/
        uint8_t uTIMER_HR : 1;                  /*Timestamp resolution setting*/
        uint8_t uSLEEP_DUR : 4;                 /*Duration to go in sleep mode*/
    };
    uint8_t byte;
} ism330dlc_WAKE_UP_DUR_t;

/*FREE_FALL*/
typedef union {
    struct {
        uint8_t uFF_DUR : 5;                    /*Free-fall duration event [4:0]*/
        uint8_t uFF_THS : 3;                    /*Free-fall threshold setting*/
    };
    uint8_t byte;
} ism330dlc_FREE_FALL_t;

/*MD1_CFG*/
typedef union {
    struct {
        uint8_t uINT1_INACT_STATE : 1;          /*Route inactivity state to INT1*/
        uint8_t uINT1_SINGLE_TAP : 1;           /*Route single-tap event to INT1*/
        uint8_t uINT1_WU : 1;                   /*Route wake-up event to INT1*/
        uint8_t uINT1_FF : 1;                   /*Route free-fall event to INT1*/
        uint8_t uINT1_DOUBLE_TAP : 1;           /*Route double-tap event to INT1*/
        uint8_t uINT1_6D : 1;                   /*Route 6D event to INT1*/
        uint8_t uINT1_TILT : 1;                 /*Route tilt event to INT1*/
        uint8_t uINT1_TIMER : 1;                /*Route timer end counter event to INT1*/
    };
    uint8_t byte;
} ism330dlc_MD1_CFG_t;

/*MD2_CFG*/
typedef union {
    struct {
        uint8_t uINT2_INACT_STATE : 1;          /*Route inactivity state to INT2*/
        uint8_t uINT2_SINGLE_TAP : 1;           /*Route single-tap event to INT2*/
        uint8_t uINT2_WU : 1;                   /*Route wake-up event to INT2*/
        uint8_t uINT2_FF : 1;                   /*Route free-fall event to INT2*/
        uint8_t uINT2_DOUBLE_TAP : 1;           /*Route double-tap event to INT2*/
        uint8_t uINT2_6D : 1;                   /*Route 6D event to INT2*/
        uint8_t uINT2_TILT : 1;                 /*Route tilt event to INT2*/
        uint8_t uINT2_IRON : 1;                 /*Route hard/soft-iron event to INT2*/
    };
    uint8_t byte;
} ism330dlc_MD2_CFG_t;

