leander98/esp32-ism330dlc/include/esp32-ism330dlc_registers.h
typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_MASTER_CMD_CODE_t;
typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_SENS_SYNC_SPI_ERROR_CODE_t;
typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_OUT_MAG_RAW_X_L_t;
typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_OUT_MAG_RAW_X_H_t;
typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_OUT_MAG_RAW_Y_L_t;
typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_OUT_MAG_RAW_Y_H_t;
typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_OUT_MAG_RAW_Z_L_t;
typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_OUT_MAG_RAW_Z_H_t;

/*INT_OIS*/
typedef union {
    struct {
        uint8_t uINT2_DRDY_OIS : 1;             /*Enable OIS chain DRDY on INT2*/
        uint8_t uLVL2_OIS : 1;                  /*Level-sensitive latched mode on OIS chain*/
        uint8_t uReserved : 6;
    };
    uint8_t byte;
} ism330dlc_INT_OIS_t;

/*CTRL1_OIS*/
typedef union {
    struct {
        uint8_t uBLE_OIS : 1;                   /*OIS endian data selection*/
        uint8_t uLVL1_OIS : 1;                  /*Level-sensitive trigger mode on OIS chain*/
        uint8_t uSIM_OIS : 1;                   /*SPI2 3- or 4-wire mode*/
        uint8_t uMODE4_EN : 1;                  /*Enable accelerometer OIS chain*/
        uint8_t uFS_G_OIS : 2;                  /*OIS gyroscope full-scale selection*/
        uint8_t uFS_125_OIS : 1;                /*Select OIS gyroscope ±125 dps full scale*/
        uint8_t uOIS_EN_SPI2 : 1;               /*Enable OIS chain data processing*/
    };
    uint8_t byte;
} ism330dlc_CTRL1_OIS_t;

/*CTRL2_OIS*/
typedef union {
    struct {
        uint8_t uReserved1 : 2;
        uint8_t uHPM_OIS : 2;                   /*OIS gyroscope HPF cutoff selection*/
        uint8_t uReserved0 : 1;
        uint8_t uFTYPE_OIS : 2;                 /*OIS gyroscope LPF1 bandwidth selection*/
        uint8_t uHP_EN_OIS : 1;                 /*Enable OIS gyroscope HPF*/
    };
    uint8_t byte;
} ism330dlc_CTRL2_OIS_t;

/*CTRL3_OIS*/
typedef union {
    struct {
        uint8_t uDEN_LH_OIS : 1;                /*DEN polarity on OIS chain*/
        uint8_t uFS_XL_OIS : 2;                 /*OIS accelerometer full-scale selection*/
        uint8_t uFILTER_XL_CONF_OIS : 2;        /*OIS accelerometer bandwidth selection*/
        uint8_t uST_OIS : 2;                    /*OIS gyroscope self-test selection*/
        uint8_t uST_OIS_CLAMPDIS : 1;           /*Disable OIS gyroscope clamp*/
    };
    uint8_t byte;
} ism330dlc_CTRL3_OIS_t;

typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_X_OFS_USR_t;
typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_Y_OFS_USR_t;
typedef union { struct { uint8_t uData : 8; }; uint8_t byte; } ism330dlc_Z_OFS_USR_t;


/*Struct declarations*/
typedef struct{
    ism330dlc_FUNC_CFG_ACCESS_t uFUNC_CFG_ACCESS;
    ism330dlc_SENSOR_SYNC_TIME_FRAME_t uSENSOR_SYNC_TIME_FRAME;
    ism330dlc_SENSOR_SYNC_RES_RATIO_t uSENSOR_SYNC_RES_RATIO;
    ism330dlc_FIFO_CTRL_1_t uFIFO_CTRL_1;
    ism330dlc_FIFO_CTRL_2_t uFIFO_CTRL_2;
    ism330dlc_FIFO_CTRL_3_t uFIFO_CTRL_3;
    ism330dlc_FIFO_CTRL_4_t uFIFO_CTRL_4;
    ism330dlc_FIFO_CTRL_5_t uFIFO_CTRL_5;
    ism330dlc_DRDY_PULSE_CFG_t uDRDY_PULSE_CFG;
    ism330dlc_INT1_CTRL_t uINT1_CTRL;
    ism330dlc_INT2_CTRL_t uINT2_CTRL;
    ism330dlc_WHO_AM_I_t uWHO_AM_I;
    ism330dlc_CTRL1_XL_t uCTRL1_XL;
    ism330dlc_CTRL2_G_t uCTRL2_G;
    ism330dlc_CTRL3_C_t uCTRL3_C;
    ism330dlc_CTRL4_C_t uCTRL4_C;
    ism330dlc_CTRL5_C_t uCTRL5_C;
    ism330dlc_CTRL6_C_t uCTRL6_C;
    ism330dlc_CTRL7_G_t uCTRL7_G;
    ism330dlc_CTRL8_XL_t uCTRL8_XL;
    ism330dlc_CTRL9_XL_t uCTRL9_XL;
    ism330dlc_CTRL10_C_t uCTRL10_C;
} ISM330DLC_Config;

typedef struct {
    ism330dlc_MASTER_CONFIG_t uMASTER_CONFIG;
    ism330dlc_WAKE_UP_SRC_t uWAKE_UP_SRC;
    ism330dlc_TAP_SRC_t uTAP_SRC;
    ism330dlc_D6D_SRC_t uD6D_SRC;
    ism330dlc_STATUS_REG_t uSTATUS_REG;
} ISM330DLC_Status;

typedef struct {
    ism330dlc_FIFO_STATUS1_t uFIFO_STATUS1;
    ism330dlc_FIFO_STATUS2_t uFIFO_STATUS2;
    ism330dlc_FIFO_STATUS3_t uFIFO_STATUS3;
    ism330dlc_FIFO_STATUS4_t uFIFO_STATUS4;
} ISM330DLC_FifoStatus;

typedef struct {
    ism330dlc_FUNC_SRC1_t uFUNC_SRC1;
    ism330dlc_FUNC_SRC2_t uFUNC_SRC2;
} ISM330DLC_FuncStatus;

typedef struct {
    ism330dlc_MD1_CFG_t uMD1_CFG;
    ism330dlc_MD2_CFG_t uMD2_CFG;
} ISM330DLC_InterruptConfig;

typedef struct {
    ism330dlc_CTRL1_OIS_t uCTRL1_OIS;
    ism330dlc_CTRL2_OIS_t uCTRL2_OIS;
    ism330dlc_CTRL3_OIS_t uCTRL3_OIS;
} ISM330DLC_OisConfig;

typedef struct {
    ism330dlc_X_OFS_USR_t uX_OFS_USR;
    ism330dlc_Y_OFS_USR_t uY_OFS_USR;
    ism330dlc_Z_OFS_USR_t uZ_OFS_USR;
} ISM330DLC_OffsetConfig;

typedef struct {
    ism330dlc_OUT_TEMP_L_t uOUT_TEMP_L;
    ism330dlc_OUT_TEMP_H_t uOUT_TEMP_H;
    ism330dlc_OUTX_L_G_t uOUTX_L_G;
    ism330dlc_OUTX_H_G_t uOUTX_H_G;
    ism330dlc_OUTY_L_G_t uOUTY_L_G;
    ism330dlc_OUTY_H_G_t uOUTY_H_G;
    ism330dlc_OUTZ_L_G_t uOUTZ_L_G;
    ism330dlc_OUTZ_H_G_t uOUTZ_H_G;
    ism330dlc_OUTX_L_XL_t uOUTX_L_XL;
    ism330dlc_OUTX_H_XL_t uOUTX_H_XL;
    ism330dlc_OUTY_L_XL_t uOUTY_L_XL;
    ism330dlc_OUTY_H_XL_t uOUTY_H_XL;
    ism330dlc_OUTZ_L_XL_t uOUTZ_L_XL;
    ism330dlc_OUTZ_H_XL_t uOUTZ_H_XL;
} ISM330DLC_Output;

typedef struct {
    ism330dlc_SENSORHUB1_REG_t uSENSORHUB1_REG;
    ism330dlc_SENSORHUB2_REG_t uSENSORHUB2_REG;
    ism330dlc_SENSORHUB3_REG_t uSENSORHUB3_REG;
    ism330dlc_SENSORHUB4_REG_t uSENSORHUB4_REG;
    ism330dlc_SENSORHUB5_REG_t uSENSORHUB5_REG;
    ism330dlc_SENSORHUB6_REG_t uSENSORHUB6_REG;
    ism330dlc_SENSORHUB7_REG_t uSENSORHUB7_REG;
    ism330dlc_SENSORHUB8_REG_t uSENSORHUB8_REG;
    ism330dlc_SENSORHUB9_REG_t uSENSORHUB9_REG;
    ism330dlc_SENSORHUB10_REG_t uSENSORHUB10_REG;
    ism330dlc_SENSORHUB11_REG_t uSENSORHUB11_REG;
    ism330dlc_SENSORHUB12_REG_t uSENSORHUB12_REG;
    ism330dlc_SENSORHUB13_REG_t uSENSORHUB13_REG;
    ism330dlc_SENSORHUB14_REG_t uSENSORHUB14_REG;
    ism330dlc_SENSORHUB15_REG_t uSENSORHUB15_REG;
    ism330dlc_SENSORHUB16_REG_t uSENSORHUB16_REG;
    ism330dlc_SENSORHUB17_REG_t uSENSORHUB17_REG;
    ism330dlc_SENSORHUB18_REG_t uSENSORHUB18_REG;
} ISM330DLC_SensorHub;

